# GetComponentWallBottomOffset

## Description
Gets the offset from wall bottom of a component in an object.

```pascal
FUNCTION GetComponentWallBottomOffset(
				obj                      : HANDLE;
				componentIndex           : INTEGER;
				VAR offsetFromWallBottom : REAL): BOOLEAN;
```

```python
def vs.GetComponentWallBottomOffset(obj, componentIndex):
    return (BOOLEAN, offsetFromWallBottom)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|obj|HANDLE|The object. Can be a wall, round wall, Wall Style, or the Wall Preferences.|
|componentIndex|INTEGER|The index of the component.|
|offsetFromWallBottom|REAL|Returns the offset from wall bottom of the component.|

## Examples
```pascal
resultOK := GetComponentWallBottomOffset(obj, 1, 1.0);
```
```python
import vs

# Gets the offset from wall bottom of a component in an object.
obj = vs.FSActLayer()  # handle to the first selected object on the active layer
componentIndex = 1

ok, offsetFromWallBottom = vs.GetComponentWallBottomOffset(obj, componentIndex)
vs.Message('GetComponentWallBottomOffset returned: ' + str((ok, offsetFromWallBottom)))
```

## See Also
VS Functions:
SetComponentWallBottomOffset

## Version
Availability: from Vectorworks 2011

## Category
* Objects - Architectural